{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Assamese",
    "1": "Bengali",
    "2": "Bhojpuri",
    "3": "English",
    "4": "Gujarati",
    "5": "Hindi",
    "6": "Kannada",
    "7": "Kashmiri",
    "8": "Malayalam",
    "9": "Marathi",
    "10": "Nepali",
    "11": "Odia",
    "12": "Punjabi",
    "13": "Tamil",
    "14": "Telugu"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Assamese": 0,
    "Bengali": 1,
    "Bhojpuri": 2,
    "English": 3,
    "Gujarati": 4,
    "Hindi": 5,
    "Kannada": 6,
    "Kashmiri": 7,
    "Malayalam": 8,
    "Marathi": 9,
    "Nepali": 10,
    "Odia": 11,
    "Punjabi": 12,
    "Tamil": 13,
    "Telugu": 14
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 197285
}